In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'shubh'],
    "mark":[93, 34, 24,17],
    "city":['dhaka', 'khulna', 'kushtia', 'kolkata'],
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  mark     city
0   harry    93    dhaka
1   rohan    34   khulna
2  skillf    24  kushtia
3   shubh    17  kolkata

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_index_false.csv', index=False)

In [8]:
df.head(2)

    name  mark    city
0  harry    93   dhaka
1  rohan    34  khulna

In [9]:
df.tail(2)

     name  mark     city
2  skillf    24  kushtia
3   shubh    17  kolkata

In [10]:
df.describe()

            mark
count   4.000000
mean   42.000000
std    34.708308
min    17.000000
25%    22.250000
50%    29.000000
75%    48.750000
max    93.000000

In [11]:
shah = pd.read_csv('shah.csv')

In [12]:
shah

   Unnamed: 0.3  Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0    name  mark     city
0             0             0             0           0   harry    99    dhaka
1             1             1             1           1   rohan    34   khulna
2             2             2             2           2  skillf    24  kushtia
3             3             3             3           3   shubh    17  kolkata

In [13]:
shah['city']

0      dhaka
1     khulna
2    kushtia
3    kolkata
Name: city, dtype: object

In [14]:
shah['mark'][0]

99

In [15]:
shah['mark'][0] = 99

C:\Users\Shah\AppData\Local\Temp\ipykernel_6856\2909341055.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  shah['mark'][0] = 99
C:\Users\Shah\AppData\Local\Temp\ipykernel_6856\2909341055.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  shah['mark'][0] = 99

In [16]:
shah

   Unnamed: 0.3  Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0    name  mark     city
0             0             0             0           0   harry    99    dhaka
1             1             1             1           1   rohan    34   khulna
2             2             2             2           2  skillf    24  kushtia
3             3             3             3           3   shubh    17  kolkata

In [17]:
shah.to_csv('shah.csv')

In [18]:
shah.index = ['1st', '2nd', '3rd', '4th']

In [19]:
shah

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,name,mark,city
1st,0,0,0,0,harry,99,dhaka
2nd,1,1,1,1,rohan,34,khulna
3rd,2,2,2,2,skillf,24,kushtia
4th,3,3,3,3,shubh,17,kolkata

In [20]:
print("shazid")

shazid

In [21]:
ser = pd.Series(np.random.rand(34))

In [22]:
type(ser)

pandas.core.series.Series

In [23]:
newdf= pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [24]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.282066  0.779639  0.559650  0.909436  0.717646
1  0.893185  0.702782  0.338949  0.131913  0.997212
2  0.501297  0.521812  0.096023  0.658269  0.042815
3  0.721650  0.393218  0.171786  0.463134  0.715370
4  0.448710  0.600996  0.188458  0.220085  0.110507

In [25]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.508096    0.483542    0.491396    0.466363    0.494699
std      0.303091    0.278128    0.294076    0.282907    0.297265
min      0.000800    0.002218    0.000251    0.009981    0.000616
25%      0.250188    0.268285    0.224565    0.231262    0.242196
50%      0.498958    0.466585    0.504224    0.429867    0.500894
75%      0.774694    0.721590    0.730087    0.694504    0.767831
max      0.999732    0.998032    0.999334    0.994541    0.997212

In [26]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
new[0][0] = "shah"

NameError: name 'new' is not defined

In [60]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [62]:
newdf.head()

          0         1         2         3         4
0  0.282066  0.779639  0.559650  0.909436  0.717646
1  0.893185  0.702782  0.338949  0.131913  0.997212
2  0.501297  0.521812  0.096023  0.658269  0.042815
3  0.721650  0.393218  0.171786  0.463134  0.715370
4  0.448710  0.600996  0.188458  0.220085  0.110507

In [64]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [66]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [68]:
newdf.to_numpy()

array([[0.28206602, 0.77963853, 0.55965025, 0.90943567, 0.71764558],
       [0.89318516, 0.70278151, 0.33894871, 0.13191271, 0.99721153],
       [0.5012969 , 0.52181247, 0.09602303, 0.65826909, 0.04281528],
       ...,
       [0.95618424, 0.88781099, 0.99720775, 0.4388993 , 0.45182743],
       [0.10348274, 0.76751058, 0.69358697, 0.41545368, 0.0543294 ],
       [0.45011234, 0.04440934, 0.26189438, 0.64136795, 0.35296648]])

In [70]:
newdf[0][0] = 0.5

C:\Users\Shah\AppData\Local\Temp\ipykernel_6856\4123818660.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = 0.5

In [72]:
newdf.head()

          0         1         2         3         4
0  0.500000  0.779639  0.559650  0.909436  0.717646
1  0.893185  0.702782  0.338949  0.131913  0.997212
2  0.501297  0.521812  0.096023  0.658269  0.042815
3  0.721650  0.393218  0.171786  0.463134  0.715370
4  0.448710  0.600996  0.188458  0.220085  0.110507

In [74]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.500000,0.893185,0.501297,0.721650,0.448710,0.697741,0.414610,0.360968,0.492622,0.949275,...,0.833024,0.856659,0.980325,0.314258,0.044837,0.287965,0.130640,0.956184,0.103483,0.450112
1,0.779639,0.702782,0.521812,0.393218,0.600996,0.175737,0.445912,0.118800,0.842760,0.486864,...,0.076437,0.608289,0.386723,0.731625,0.412760,0.835604,0.475514,0.887811,0.767511,0.044409
2,0.559650,0.338949,0.096023,0.171786,0.188458,0.959889,0.741110,0.212658,0.999334,0.190196,...,0.945817,0.383159,0.118408,0.620434,0.032135,0.928888,0.179453,0.997208,0.693587,0.261894
3,0.909436,0.131913,0.658269,0.463134,0.220085,0.914644,0.363152,0.659900,0.970884,0.270317,...,0.041860,0.117469,0.228595,0.100592,0.291574,0.130187,0.412287,0.438899,0.415454,0.641368
4,0.717646,0.997212,0.042815,0.715370,0.110507,0.687463,0.240107,0.086986,0.415728,0.708951,...,0.541469,0.591788,0.832052,0.298574,0.873793,0.341904,0.324832,0.451827,0.054329,0.352966

In [76]:
newdf.head()

          0         1         2         3         4
0  0.500000  0.779639  0.559650  0.909436  0.717646
1  0.893185  0.702782  0.338949  0.131913  0.997212
2  0.501297  0.521812  0.096023  0.658269  0.042815
3  0.721650  0.393218  0.171786  0.463134  0.715370
4  0.448710  0.600996  0.188458  0.220085  0.110507

In [78]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.717646  0.909436  0.559650  0.779639  0.500000
1    0.997212  0.131913  0.338949  0.702782  0.893185
2    0.042815  0.658269  0.096023  0.521812  0.501297
3    0.715370  0.463134  0.171786  0.393218  0.721650
4    0.110507  0.220085  0.188458  0.600996  0.448710
..        ...       ...       ...       ...       ...
329  0.341904  0.130187  0.928888  0.835604  0.287965
330  0.324832  0.412287  0.179453  0.475514  0.130640
331  0.451827  0.438899  0.997208  0.887811  0.956184
332  0.054329  0.415454  0.693587  0.767511  0.103483
333  0.352966  0.641368  0.261894  0.044409  0.450112

[334 rows x 5 columns]

In [80]:
newdf.head()

          0         1         2         3         4
0  0.500000  0.779639  0.559650  0.909436  0.717646
1  0.893185  0.702782  0.338949  0.131913  0.997212
2  0.501297  0.521812  0.096023  0.658269  0.042815
3  0.721650  0.393218  0.171786  0.463134  0.715370
4  0.448710  0.600996  0.188458  0.220085  0.110507

In [82]:
type(newdf[0])

pandas.core.series.Series

In [84]:
newdf2 =newdf.copy()

In [86]:
newdf2[0][0] = 9785

C:\Users\Shah\AppData\Local\Temp\ipykernel_6856\570901836.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0] = 9785

In [88]:
newdf

            0         1         2         3         4
0    0.500000  0.779639  0.559650  0.909436  0.717646
1    0.893185  0.702782  0.338949  0.131913  0.997212
2    0.501297  0.521812  0.096023  0.658269  0.042815
3    0.721650  0.393218  0.171786  0.463134  0.715370
4    0.448710  0.600996  0.188458  0.220085  0.110507
..        ...       ...       ...       ...       ...
329  0.287965  0.835604  0.928888  0.130187  0.341904
330  0.130640  0.475514  0.179453  0.412287  0.324832
331  0.956184  0.887811  0.997208  0.438899  0.451827
332  0.103483  0.767511  0.693587  0.415454  0.054329
333  0.450112  0.044409  0.261894  0.641368  0.352966

[334 rows x 5 columns]

In [90]:
newdf.loc[0,0] = 654

In [92]:
newdf.head(2)

            0         1         2         3         4
0  654.000000  0.779639  0.559650  0.909436  0.717646
1    0.893185  0.702782  0.338949  0.131913  0.997212

In [94]:
newdf.columns = list("ABCDE")

In [96]:
newdf

              A         B         C         D         E
0    654.000000  0.779639  0.559650  0.909436  0.717646
1      0.893185  0.702782  0.338949  0.131913  0.997212
2      0.501297  0.521812  0.096023  0.658269  0.042815
3      0.721650  0.393218  0.171786  0.463134  0.715370
4      0.448710  0.600996  0.188458  0.220085  0.110507
..          ...       ...       ...       ...       ...
329    0.287965  0.835604  0.928888  0.130187  0.341904
330    0.130640  0.475514  0.179453  0.412287  0.324832
331    0.956184  0.887811  0.997208  0.438899  0.451827
332    0.103483  0.767511  0.693587  0.415454  0.054329
333    0.450112  0.044409  0.261894  0.641368  0.352966

[334 rows x 5 columns]

In [98]:
newdf.loc[0,'A'] = 65434

In [100]:
newdf

                A         B         C         D         E
0    65434.000000  0.779639  0.559650  0.909436  0.717646
1        0.893185  0.702782  0.338949  0.131913  0.997212
2        0.501297  0.521812  0.096023  0.658269  0.042815
3        0.721650  0.393218  0.171786  0.463134  0.715370
4        0.448710  0.600996  0.188458  0.220085  0.110507
..            ...       ...       ...       ...       ...
329      0.287965  0.835604  0.928888  0.130187  0.341904
330      0.130640  0.475514  0.179453  0.412287  0.324832
331      0.956184  0.887811  0.997208  0.438899  0.451827
332      0.103483  0.767511  0.693587  0.415454  0.054329
333      0.450112  0.044409  0.261894  0.641368  0.352966

[334 rows x 5 columns]

In [102]:
newdf.drop(0, axis = 1)

KeyError: '[0] not found in axis'

In [ ]:
newdf.loc[[1,2], ['C','D']]

In [ ]:
newdf.head()

In [ ]:
newdf.loc[:, ['C','D']]

In [ ]:
newdf.loc[[1,2], :]

In [103]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D         E
20   0.041215  0.692861  0.276760  0.086144  0.241263
25   0.181196  0.326241  0.677147  0.438217  0.276795
38   0.074883  0.504160  0.206040  0.305662  0.668633
39   0.157760  0.818533  0.709541  0.744972  0.813271
40   0.187072  0.939158  0.464356  0.539325  0.838368
..        ...       ...       ...       ...       ...
320  0.079754  0.691244  0.968349  0.400433  0.225252
328  0.044837  0.412760  0.032135  0.291574  0.873793
329  0.287965  0.835604  0.928888  0.130187  0.341904
330  0.130640  0.475514  0.179453  0.412287  0.324832
332  0.103483  0.767511  0.693587  0.415454  0.054329

[102 rows x 5 columns]

In [110]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
20   0.041215  0.692861  0.276760  0.086144  0.241263
25   0.181196  0.326241  0.677147  0.438217  0.276795
38   0.074883  0.504160  0.206040  0.305662  0.668633
39   0.157760  0.818533  0.709541  0.744972  0.813271
40   0.187072  0.939158  0.464356  0.539325  0.838368
..        ...       ...       ...       ...       ...
319  0.185636  0.359641  0.679850  0.817719  0.076903
320  0.079754  0.691244  0.968349  0.400433  0.225252
329  0.287965  0.835604  0.928888  0.130187  0.341904
330  0.130640  0.475514  0.179453  0.412287  0.324832
332  0.103483  0.767511  0.693587  0.415454  0.054329

[89 rows x 5 columns]

In [120]:
newdf.head()

              A         B         C         D         E
0  65434.000000  0.779639  0.559650  0.909436  0.717646
1      0.893185  0.702782  0.338949  0.131913  0.997212
2      0.501297  0.521812  0.096023  0.658269  0.042815
3      0.721650  0.393218  0.171786  0.463134  0.715370
4      0.448710  0.600996  0.188458  0.220085  0.110507

In [122]:
newdf.iloc[0,4]

0.7176455793032109

In [124]:
newdf.iloc[[0,1], [1,2]]

          B         C
0  0.779639  0.559650
1  0.702782  0.338949

In [126]:
newdf.head(3)

              A         B         C         D         E
0  65434.000000  0.779639  0.559650  0.909436  0.717646
1      0.893185  0.702782  0.338949  0.131913  0.997212
2      0.501297  0.521812  0.096023  0.658269  0.042815

In [128]:
newdf.drop(0)

            A         B         C         D         E
1    0.893185  0.702782  0.338949  0.131913  0.997212
2    0.501297  0.521812  0.096023  0.658269  0.042815
3    0.721650  0.393218  0.171786  0.463134  0.715370
4    0.448710  0.600996  0.188458  0.220085  0.110507
5    0.697741  0.175737  0.959889  0.914644  0.687463
..        ...       ...       ...       ...       ...
329  0.287965  0.835604  0.928888  0.130187  0.341904
330  0.130640  0.475514  0.179453  0.412287  0.324832
331  0.956184  0.887811  0.997208  0.438899  0.451827
332  0.103483  0.767511  0.693587  0.415454  0.054329
333  0.450112  0.044409  0.261894  0.641368  0.352966

[333 rows x 5 columns]

In [157]:
newdf.head(3)

          B         C         E
0  0.779639  0.559650  0.717646
2  0.521812  0.096023  0.042815
3  0.393218  0.171786  0.715370

In [159]:
newdf.reset_index(drop=True, inplace=True)

In [161]:
newdf.head(3)

          B         C         E
0  0.779639  0.559650  0.717646
1  0.521812  0.096023  0.042815
2  0.393218  0.171786  0.715370

In [163]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [165]:
newdf['B'] = None

In [167]:
newdf

        B         C         E
0    None  0.559650  0.717646
1    None  0.096023  0.042815
2    None  0.171786  0.715370
3    None  0.188458  0.110507
4    None  0.741110  0.240107
..    ...       ...       ...
327  None  0.928888  0.341904
328  None  0.179453  0.324832
329  None  0.997208  0.451827
330  None  0.693587  0.054329
331  None  0.261894  0.352966

[332 rows x 3 columns]

In [169]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [171]:
newdf.loc[:,['B']] = None

In [173]:
newdf

        B         C         E
0    None  0.559650  0.717646
1    None  0.096023  0.042815
2    None  0.171786  0.715370
3    None  0.188458  0.110507
4    None  0.741110  0.240107
..    ...       ...       ...
327  None  0.928888  0.341904
328  None  0.179453  0.324832
329  None  0.997208  0.451827
330  None  0.693587  0.054329
331  None  0.261894  0.352966

[332 rows x 3 columns]

In [193]:
df = pd.DataFrame({"name": ['alfred', 'batman', 'alfred'],
                   "toy": [np.nan, np.nan, np.nan],
                   "bron": [pd.NaT, pd.Timestamp("1940-04-25"),
                                                 pd.NaT]})

In [195]:
df.head()

     name  toy       bron
0  alfred  NaN        NaT
1  batman  NaN 1940-04-25
2  alfred  NaN        NaT

In [197]:
df.dropna(how='all', axis=1)

     name       bron
0  alfred        NaT
1  batman 1940-04-25
2  alfred        NaT

In [199]:
df.drop_duplicates(subset= ['name'])

     name  toy       bron
0  alfred  NaN        NaT
1  batman  NaN 1940-04-25

In [203]:
df.drop_duplicates(subset= ['name'], keep='first')

     name  toy       bron
0  alfred  NaN        NaT
1  batman  NaN 1940-04-25

In [205]:
df.drop_duplicates(subset= ['name'], keep='last')

     name  toy       bron
1  batman  NaN 1940-04-25
2  alfred  NaN        NaT

In [207]:
df.drop_duplicates(subset= ['name'], keep=False)

     name  toy       bron
1  batman  NaN 1940-04-25

In [211]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     0 non-null      float64
 2   bron    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 204.0+ bytes

In [213]:
df['name'].value_counts(dropna=False)

name
alfred    2
batman    1
Name: count, dtype: int64

In [215]:
df['toy'].value_counts(dropna=False)

toy
NaN    3
Name: count, dtype: int64

In [217]:
df['name'].value_counts(dropna=True)

name
alfred    2
batman    1
Name: count, dtype: int64

In [219]:
df.isnull()

    name   toy   bron
0  False  True   True
1  False  True  False
2  False  True   True

In [221]:
df.notnull()

   name    toy   bron
0  True  False  False
1  True  False   True
2  True  False  False

In [233]:
df = pd.DataFrame ({
    'Column1': [1, 2, 3],  
    'Column2': [4, 5, 6]  
})

In [235]:
df.head()

   Column1  Column2
0        1        4
1        2        5
2        3        6

In [237]:
df.describe()

       Column1  Column2
count      3.0      3.0
mean       2.0      5.0
std        1.0      1.0
min        1.0      4.0
25%        1.5      4.5
50%        2.0      5.0
75%        2.5      5.5
max        3.0      6.0

In [239]:
df.mean()

Column1    2.0
Column2    5.0
dtype: float64

In [243]:
df.corr()

         Column1  Column2
Column1      1.0      1.0
Column2      1.0      1.0

In [245]:
df.count()

Column1    3
Column2    3
dtype: int64

In [247]:
df.max()

Column1    3
Column2    6
dtype: int64

In [249]:
df.min()

Column1    1
Column2    4
dtype: int64

In [251]:
df.median()

Column1    2.0
Column2    5.0
dtype: float64

In [253]:
df.std()

Column1    1.0
Column2    1.0
dtype: float64

In [278]:
data = pd.read_excel('data.xlsm')

In [276]:
shah

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,name,mark,city
1st,0,0,0,0,harry,99,dhaka
2nd,1,1,1,1,rohan,34,khulna
3rd,2,2,2,2,skillf,24,kushtia
4th,3,3,3,3,shubh,17,kolkata

In [288]:
print(data.columns)

columns_to_drop = ['Unnamed: 0.3', 'Unnamed: 0.2', 'Unnamed: 0.1', 'Unnamed: 0']


columns_to_drop = [col for col in columns_to_drop if col in data.columns]


data.drop(columns=columns_to_drop, axis=1, inplace=True)

Index(['name', 'mark', 'city'], dtype='object')

In [290]:
df.head()

   Column1  Column2
0        1        4
1        2        5
2        3        6

In [303]:
data = pd.read_excel('data.xlsm',sheet_name='Sheet 1')

In [307]:
data

     name  mark     city
0   harry    56    dhaka
1   rohan    84   khulna
2  skillf    54  kushtia
3   shubh    97  kolkata

In [311]:
data = pd.read_excel('data.xlsm', sheet_name='Sheet2')

In [313]:
data

     name2  mark2     city2
0   harry2     56    dhaka2
1   rohan2     84   khulna2
2  skillf2     54  kushtia2
3   shubh2     97  kolkata2

In [315]:
data.iloc[0,0] = 34

In [317]:
data

     name2  mark2     city2
0       34     56    dhaka2
1   rohan2     84   khulna2
2  skillf2     54  kushtia2
3   shubh2     97  kolkata2

In [325]:
data.to_excel('data.xlsm', sheet_name='Sheet2')

In [327]:
data

     name2  mark2     city2
0       34     56    dhaka2
1   rohan2     84   khulna2
2  skillf2     54  kushtia2
3   shubh2     97  kolkata2